tap "adoptopenjdk/openjdk"
tap "autozimu/formulas"
tap "dart-lang/dart"
tap "eugenmayer/dockersync"
tap "felixkratz/formulae"
tap "heroku/brew"
tap "homebrew/services"
tap "khanhas/tap"
tap "koekeishiya/formulae"
tap "popcorn-official/popcorn-desktop", "https://github.com/popcorn-official/popcorn-desktop.git"
tap "rigellute/tap"
tap "sass/sass"
tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
brew "jpeg-xl"
brew "aom"
brew "openssl@3"
brew "apr-util"
brew "asdf"
brew "readline"
brew "pycparser"
brew "cffi"
brew "awscli"
brew "libssh2"
brew "bat"
brew "boost"
brew "python@3.11"
brew "bpytop"
brew "btop"
brew "capstone"
brew "gmp"
brew "libevent"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "cask"
brew "certbot"
brew "cliclick"
brew "cmake"
brew "libyaml"
brew "cocoapods", link: false
brew "colordiff"
brew "cowsay"
brew "cryptopp"
brew "rtmpdump"
brew "curl"
brew "deno"
brew "diff-so-fancy", args: ["HEAD"]
brew "docker-compose"
brew "docutils"
brew "dos2unix"
brew "dotbot"
brew "duf"
brew "dust"
brew "folly"
brew "fizz"
brew "wangle"
brew "fbthrift"
brew "fb303"
brew "edencommon"
brew "eza"
brew "fastfetch"
brew "fd"
brew "ffmpegthumbnailer"
brew "flyctl"
brew "foreman"
brew "freetds"
brew "fzf"
brew "libavif"
brew "gd"
brew "gh"
brew "git"
brew "gnu-sed"
brew "libksba"
brew "gnupg"
brew "go"
brew "gradle@6"
brew "graphviz"
brew "gsl"
brew "hadolint"
brew "lua"
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "lazydocker"
brew "lazygit", args: ["HEAD"]
brew "leveldb"
brew "libfido2"
brew "libjson-rpc-cpp"
brew "libpq"
brew "libsass"
brew "libslirp"
brew "lua-language-server"
brew "luarocks"
brew "macchina"
brew "manifest-tool"
brew "midnight-commander"
brew "mysql"
brew "mysql-client"
brew "mysql-client@8.0"
brew "neovim"
brew "nghttp2"
brew "ninja"
brew "nmap"
brew "node", link: false
brew "node@14"
brew "nvm"
brew "ollama"
brew "openjdk@17"
brew "openssl@1.1"
brew "poppler"
brew "postgresql@14", restart_service: :changed
brew "postgresql@15", restart_service: :changed
brew "protobuf"
brew "protobuf-c"
brew "protobuf@3"
brew "putty"
brew "pyenv"
brew "python-tk@3.11"
brew "python-tk@3.9"
brew "python@3.10"
brew "ruby-build"
brew "rbenv"
brew "rcm"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "rust"
brew "rustup"
brew "spotifyd", restart_service: :changed
brew "starship"
brew "stylua"
brew "ta-lib"
brew "tcl-tk"
brew "the_silver_searcher"
brew "tldr"
brew "tmux"
brew "tree"
brew "unar"
brew "universal-ctags", args: ["HEAD"]
brew "upx"
brew "vifm"
brew "vim"
brew "watchman"
brew "wget"
brew "yaml-language-server"
brew "yarn", link: false
brew "zf"
brew "zoxide"
brew "zsh"
brew "felixkratz/formulae/sketchybar"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "sass/sass/sass"
cask "alfred"
cask "bitwarden"
cask "caffeine"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "font-symbols-only-nerd-font"
cask "ghostty"
cask "gpg-suite"
cask "hammerspoon"
cask "kitty"
cask "lulu"
cask "macforge"
cask "ngrok"
cask "postman"
cask "sequel-ace"
cask "steam"
cask "ubersicht"
cask "whatsapp"
cask "windsurf"
cask "xquartz"
vscode "1yib.rust-bundle"
vscode "alefragnani.project-manager"
vscode "anysphere.pyright"
vscode "benjaminbenais.copilot-theme"
vscode "bmewburn.vscode-intelephense-client"
vscode "build-hackathon.aleoedge"
vscode "chunsen.bracket-select"
vscode "donjayamanne.githistory"
vscode "dustypomerleau.rust-syntax"
vscode "dzhavat.bracket-pair-toggler"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "ex-codes.pine-script-syntax-highlighter"
vscode "fallenmax.mithril-emmet"
vscode "feiskyer.chatgpt-copilot"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "humao.rest-client"
vscode "jeylanib.pine-editor-themes"
vscode "jeylanib.pinescript"
vscode "johnpapa.vscode-peacock"
vscode "juanblanco.solidity"
vscode "kimseungtae.aicodehelper"
vscode "leifcr.pine-script-syntax-highlighting"
vscode "metatype.copilot-vscode"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-ko"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "mtuan.typing-sounds-2"
vscode "pgourlain.erlang"
vscode "phoihos.csv-to-md-table"
vscode "pranaygp.vscode-css-peek"
vscode "rifi2k.format-html-in-php"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "serayuzgur.crates"
vscode "swellaby.rust-pack"
vscode "tamasfe.even-better-toml"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscode-aleo.vscode-aleo"
vscode "vue.volar"
vscode "yuce.erlang-otp"
